# Version:1.0 MMMC View Definition File
# Do Not Remove Above Line
create_rc_corner -name VRCCorner -cap_table {lib/cap/NangateOpenCellLibrary.cap} -preRoute_res {1.0} -preRoute_cap {1.0} -preRoute_clkres {0.0} -preRoute_clkcap {0.0} -postRoute_res {1.0} -postRoute_cap {1.0} -postRoute_xcap {1.0} -postRoute_clkres {0.0} -postRoute_clkcap {0.0}
create_library_set -name VTLib -timing {lib/lib/NangateOpenCellLibrary_typical.lib}
create_constraint_mode -name VSDC -sdc_files {pmul32_4_fm.sdc}
create_delay_corner -name VDCCorner -library_set {VTLib} -rc_corner {VRCCorner}
create_analysis_view -name VView1 -constraint_mode {VSDC} -delay_corner {VDCCorner}
set_analysis_view -setup {VView1} -hold {VView1}
